
##############################################################################
############                                                     #############
############                      TASK 1                         #############
############                                                     #############
##############################################################################
'''
створіть АРІ за допомогою гугл таблиць (код підключення на гіті) з
наступними ключами
name - строковий тип
age - ціле число
score - флоатове
has_rewards - булеве (в гугл таблицях задається в меню вставити-прапорець)
notes - строковий тип

додайте не менше 10 записів, все має бути заповнене та дані мають бути
валідними за типами, значення на рівні нормальних (тобто вік до 30 років,
позитивний, і так далі, не вносьте маячню)
20 балів
'''
##############################################################################
############                                                     #############
############                      TASK 2                         #############
############                                                     #############
##############################################################################
'''
створіть функцію для перевірки, що за замовчуванням число не менше 0 та не 
більше 100 (потрібно, щоб верхня та нижня межа могли налаштовуватися)
створіть функцію для перевірки, що отриманий аргумент є числом (інт)
створіть функцію, що отримує урл та віддає json, отриманий через цей урл
(валідувати не потрібно, ми поки що працюємо з даними, вважаючи, 
що вони валідні)
створити функцію, яка приймає стрічку, і має її повернути, враховуючи , що ця
стрічка має бути довжиною не більше 150 символів (може регулюватися через 
передачу аргумента функції), а якщо отримана стрічка буде довшою за 150 
символів, то стрічка має бути обрізана до 150 символів, причому останні
три символи мають бути ... (трьома крапками)
написати функцію, котра дозаписує (режим "а") в файл певні текстові дані
покрити все тестами (окрім запису в файл, це буде занадто)
40 балів
'''
##############################################################################
############                                                     #############
############                      TASK 3                         #############
############                                                     #############
##############################################################################
'''
створити функцію, котра приймає урл (та опційний параметр bd булевого формату
для завдання 4), і очікує там словник з ключами, описаними в завданні 1
в функції перевіряється, що якщо в учня бали від 90 до 100, учень має 
винагороди, його вік від 9 до 18 років, то формуємо стрічку типу:

"[Запит від {}] Учень {імя} {смайл} є відмінником, його бал {бал}, 
відзначимо, що {примітки}"

стрічку обрізаємо до 150 символів і добавляємо в файл
поле запит від в стрічці формуємо використанням коду
import datetime
now = datetime.datetime.now().date()
після імені учня вставте смайл на ваш вибір (список смайлів має зберігатися
окремо в файлі)

35 балів
'''

##############################################################################
############                                                     #############
############                      TASK 4                         #############
############                   HAVE FUN WITH                     #############
############                     MONGO DB                        #############
##############################################################################
'''
токен пропишіть як констнанту в окремому файлі конфігів, 
назву бд та колекції також тримати в файлі конфігів

написати функцію, яка підєднується за токеном до бази даних, створює базу 
даних, колекцію.

доробити функцію з завдання 3: якщо bd True, то ми формуємо ту ж стрічку
(проте без смайла, можете передбачити в колекції смайлів смайл як пуста 
стрічка), і записуємо в базу даних або по одному валідні json дані, або ж
добавляємо їх в список  і використовуємо insert_many

зауважте, що ви відправляєте замість notes тест нашої стрічки до 150 символів,
інші поля залишаються без змін

id не відправляйте, нехай формується автоматично


напишіть функцію, котра отримує всі дані з бази даних (назва бд та колекції 
у вас в конфігах)

'''